Catalogs/ВидыДоговоровАвторскогоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыДоговоровАвторскогоЗаказа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДоговоровАвторскогоЗаказа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЭлемент(ОписаниеЭлемента)

	Объект = Справочники.ВидыДоговоровАвторскогоЗаказа.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Объект, ОписаниеЭлемента);
	Объект.Записать();

КонецПроцедуры

Процедура СоздатьПредопределенныеВидыДоговоров() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.ВидыДоговоровАвторскогоЗаказа КАК ВидыДоговоровАвторскогоЗаказа";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// ЗУПК
		Описание = Новый Структура("
		|Наименование,
		|КодДоходаНДФЛ,
		|КодДоходаСтраховыеВзносы");
		
		Описание.Наименование = "Создание литературных произведений";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2201;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеЛитературныеПроизведения;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание художественно-графических произведений";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2202;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеГрафическиеПроизведения;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание произведений скульптуры, монументально-декоративной живописи";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2203;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеСкульптуры;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание аудиовизуальных произведений";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2204;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание музыкально-сценических произведений";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2205;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание других музыкальных произведений";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2206;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Исполнение произведений литературы и искусства";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2207;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеИсполнениеПроизведений;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание научных трудов и разработок";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2208;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеНаучныеТруды;
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Открытия, изобретения и создание промышленных образцов";
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.Код2209;
		Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.АвторскиеОткрытия;
		ЗаписатьЭлемент(Описание);
	// ЗУПК
	Иначе
		Описание = Новый Структура("
		|Наименование");
		
		Описание.Наименование = "Создание литературных произведений";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание драматических и музыкально-драматических произведений";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание сценарных произведений";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание произведений хореографии и пантомимы";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание музыкальных произведений с текстом или без текста";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание аудиовизуальных произведений";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание произведений живописи, скульптуры, графики и других произведений изобразительного искусства";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание произведений прикладного искусства";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание произведений архитектуры, градостроительства и садово-паркового искусства";
		ЗаписатьЭлемент(Описание);
		
		Описание.Наименование = "Создание фотографических произведений и произведений, полученных способами, аналогичными фотографии";
		ЗаписатьЭлемент(Описание);

		Описание.Наименование = "Создание карт, планов, эскизов, иллюстраций и трехмерных произведений, относящихся к географии, топографии и к другим наукам";
		ЗаписатьЭлемент(Описание);

		Описание.Наименование = "Создание программ для ЭВМ";
		ЗаписатьЭлемент(Описание);

		Описание.Наименование = "Создание иных произведений";
		ЗаписатьЭлемент(Описание);
	КонецЕсли;
	// ЗУПК

КонецПроцедуры

#КонецОбласти

#КонецЕсли
